Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: As postfixes the brackets may be separated from their initial :foo with either unspace or dot (or both), but nothing else.
ja: 接尾辞として、ブラケットはどちらのunspaceまたは点（または両方とも）（他の何以外のでないも）ででも彼らの最初の:fooから切り離されるかもしれない。

source: Regardless of syntax, adverbs used as named arguments (in either term or infix position) generally show up as optional named parameters to the function in question--even if the function is an operator or macro.
ja: 構文に関係なく、一般に名をつけられた引数（どちらの項または挿入辞位置ででも）として使われる副詞は ― たとえ関数が演算子またはマクロであるとしても ― 問題の関数へのオプションの挙げられたパラメータとして現れる。

source: The function in question neither knows nor cares how weird the original syntax was.
ja: 問題の関数は、知りもしなく、最初の構文がどれくらい怪しくもあったかについて気にしない。

source: Q forms
ja: Qの形

source: In addition to q and qq, there is now the base form Q which does no interpolation unless explicitly modified to do so.
ja: qとqqに加えて、はっきりとそうするために修正されない限り、展開をしない主成分の形Qが、現在ある。

source: So q is really short for Q:q and qq is short for Q:qq.
ja: それで、qは本当にQ:qの省略である、そして、qqはQ:qqの省略である。

source: In fact, all quote-like forms derive from Q with adverbs:
ja: 実際、すべての引用のような形は、副詞でQに由来する：

source: Adverbs such as :regex change the language to be parsed by switching to a different parser.
ja: :regexのような副詞は、異なる構文解析器に変わることによって解析されるために、言語を変える。

source: This can completely change the interpretation of any subsequent adverbs as well as the quoted material itself.
ja: これは、何か以降の副詞ならびに引用された資料自体の字句解釈を完全に変えることができる。

source: Just as q[...] has the short form '...', and qq[...] has the short form &quot;...&quot;, the completely quoted Q[...] has a short form that uses halfwidth corner brackets:
ja: ちょうどq[...]がショート形式'...'を持って、そして、qq[...]はショート形式&quot;...&quot;を持つ、完全に引合いに出されたQ[...]にはhalfwidthな隅持送りを使うショート形式がある：

source: Adverbs on quotes
ja: 引用の副詞

source: Generalized quotes may now take adverbs:
ja: 全般的な引用は、現在副詞をとるかもしれない：

source: You may omit the first colon by joining an initial Q, q, or qq with a single short form adverb, which produces forms like:
ja: あなたは最初のQ、qまたはqqを一つのショート形式副詞でつなぐことによって最初のコロンを省略するかもしれない。そして、それは以下のような形を生じる：

source: (Note that qx// doesn't interpolate.)
ja: （qx//が差し込まない注。）

source: If you want to abbreviate further, just define a macro:
ja: あなたがさらに簡約したいならば、ちょうどマクロを定義しなさい：

source: All the uppercase adverbs are reserved for user-defined quotes.
ja: すべての大文字の副詞は、ユーザー定義の引用のために予約されている。

source: All Unicode delimiters above Latin-1 are reserved for user-defined quotes.
ja: ラテン語-1より上のすべてのユニコードデリミタは、ユーザー定義の引用のために予約されている。

source: A consequence of the above is that we can now say:
ja: 上記の結果は、我々が現在、以下のように言うことができるということである：

source: to interpolate items into a qw.
ja: qwにアイテムを差し込むこと。

source: Conveniently, arrays and hashes interpolate with only whitespace separators by default, so the subsequent split on whitespace still works out.
ja: 都合の良いことに、配列とハッシュはデフォルトで空白文字セパレーターだけで改竄するので、空白文字の以降の分裂はまだ外へ動く。

source: (But the built-in ≪...≫ quoter automatically does interpolation equivalent to qq:ww:v/.../.
ja: （しかし、ビルトイン≪...≫引用者は、qq:ww:v/.../に展開等価物を自動的にする。

source: The built-in &lt;...&gt; is equivalent to q:w:v/.../.)
ja: ビルトイン&lt;...&gt;は、q:w:v/.../に等しい。）

source: The :val modifier
ja: :val修飾子

source: The :v/:val modifier runs each word through the val() function, which will attempt to recognize literals as defined by the current slang.
ja: :v/:val修飾子は各々のワードをval()関数に通す。そして、現在の俗語によって定義されるように、それはリテラルを認知しようとする。

source: (See &quot;Allomorphic value semantics&quot; below.) Only pure literals such as numbers, versions, and enums are so recognized;
ja: 数、バージョンと列挙型のような純粋なリテラルだけは、とても公認である（下記の「Allomorphic値意味論」を見なさい。）;

source: all other words are left as strings.
ja: 他の全てのワードは、文字列として残される。

source: In any case, use of such an intuited value as a string will reproduce the original string including any leading or trailing whitespace:
ja: いずれにせよ、文字列のような直観された値の使用は、何か主要なまたは後置空白文字を含む元の文字列を複製する：

source: Of course, words derived from :w and :ww will not have any whitespace, since that is what the words are split apart on.
ja: もちろん、ワードは:wに由来した、そして、それがワードが離れて分裂であるものである時から、:wwは何か空白文字を持っていない。

source: Whitespace before adverbs
ja: 副詞の前の空白文字

source: Whitespace is allowed between the &quot;q&quot; and its adverb:
ja: 空白文字は、「q」とその副詞の間で許される：

source: Delimiters of quoting forms
ja: 書式を引用するデリミタ

source: For these &quot;q&quot; forms the choice of delimiters has no influence on the semantics.
ja: これらの「q」形式については、デリミタの選択には、意味論に対する影響がない。

source: That is, '', &quot;&quot;, &lt;&gt;, ≪≫, ``, (), [], and have no special significance when used in place of // as delimiters.
ja: つまり、デリミタとして//の代わりに使われるとき、''、&quot;&quot;、&lt;&gt;、≪≫、``、()、[]とは特別な重要性を持たない。

source: There may be whitespace before the opening delimiter.
ja: 空白文字が、始めのデリミタの前にあるかもしれない。

source: (Which is mandatory for parens because q() is a subroutine call and q:w(0) is an adverb with arguments).
ja: （q()がサブルーチン呼出しである、そして、q:w(0)が引数による副詞であるので、括弧のために義務的な）。

source: A colon may never be used as the delimiter since it will always be taken to mean another adverb regardless of what's in front of it.
ja: それの前にあることに関係なくもう一つの副詞を意味することが常にされる時から、コロンがデリミタとして決して使われないかもしれない。

source: Nor may a # character be used as the delimiter since it is always taken as whitespace (specifically, as a comment).
ja: そして、それからデリミタが常に空白文字周知のことと見なされて、#文字が使われないかもしれないとりわけ、コメントとして、（）。

source: You may not use whitespace or alphanumerics for delimiters.
ja: デリミタのために空白文字または英数字を使わなくてもよい。

source: Quotes from Macros
ja: マクロからの引用

source: New quoting constructs may be declared as macros:
ja: 新しい引合いに出している構成概念は、マクロと宣言されるかもしれない：

source: Note:
ja: 注：

source: macro adverbs are automatically evaluated at macro call time if the adverbs are included in the parse.
ja: 副詞が解析に含まれるならば、マクロ副詞はマクロ呼出し時間に自動的に評価される。

source: If an adverb needs to affect the parsing of the quoted text of the macro, then an explicit named parameter may be passed on as a parameter to the is parsed subrule, or used to select which subrule to invoke.
ja: 副詞がマクロの引用されたテキストの構文解析に影響を及ぼす必要があるならば、明示的挙げられたパラメータは｛解析される｝subruleへのパラメータとして渡されるかもしれないか、どのsubruleに訴えるべきかについて選んだものである。

source: Interpolating into a single-quoted string
ja: 一つの引用符付きの文字列への補間

source: You may interpolate double-quotish text into a single-quoted string using the \qq[...] construct.
ja: あなたは、\qq[...]構成概念を使っている一つの引用符付きの文字列に、二重のquotishテキストを改変するかもしれない。

source: Other &quot;q&quot; forms also work, including user-defined ones, as long as they start with &quot;q&quot;.
ja: それらが「q」から始める限り、ユーザー定義のものを含んで、他の「q」形式も動く。

source: Otherwise you'll just have to embed your construct inside a \qq[...].
ja: さもなければ、あなたはちょうど構成概念を\qq[...]に埋めなければならない。

source: Interpolation rules
ja: 展開規則

source: Bare scalar variables always interpolate in double-quotish strings.
ja: ぎりぎりのスカラー変数は、常に二重のquotish文字列で改竄する。

source: Bare array, hash, and subroutine variables may never be interpolated.
ja: 裸の配列、ハッシュとサブルーチン変数は、決して差し込まれないかもしれない。

source: However, any scalar, array, hash or subroutine variable may start an interpolation if it is followed by a sequence of one or more bracketed dereferencers:
ja: しかし、それの後に一連の一つ以上の括弧に入れられたdereferencersが続くならば、スカラー何でも、配列、ハッシュまたはサブルーチン変数は改竄者を始めるかもしれない：

source: that is, any of:
ja: つまり、以下のどれでも：

source: 1. An array subscript
ja: 1. 配列の添え字

source: 2. A hash subscript
ja: 2. ハッシュ添え字

source: 3. A set of parentheses indicating a function call
ja: 3. 関数呼び出しを示している一組の括弧

source: 4. Any of 1 through 3 in their dot form
ja: 4. 彼らの点フォームの3を通しての1のどれでも

source: 5. A method call that includes argument parentheses
ja: 5. 引数括弧を含むメソッド呼び出し

source: 6. A sequence of one or more unparenthesized method call, followed by any of 1 through 5
ja: 6. 一連の一つ以上のunparenthesizedされたメソッドは訪問する。そして、5を通して1のどれでも続く、

source: In other words, this is legal:
ja: 言い換えると、これは合法的である：

source: and is equivalent to
ja: そして、等価物である

source: However, no interpolated postfix may start with a backslash, so any backslash or unspace is not recognized, but instead will be assumed to be part of the string outside of the interpolation, and subject to the normal backslashing rules of that quote context:
ja: しかし、差し込まれた接尾辞はバックスラッシュから始めないかもしれないので、何かバックスラッシュまたはunspaceは認知されなくて、その代わりに、展開の外の、そして、その引用前後関係の通常のbackslashingしている原則を前提として文字列の一部であるとされる：

source: Arrays
ja: 配列

source: In order to interpolate an entire array, it's necessary now to subscript with empty brackets:
ja: 全ての配列を差し込むために、それは空のブラケットで現在添え字に必要である：

source: Note that this fixes the spurious &quot;@&quot; problem in double-quoted email addresses.
ja: これが倍を引合いに出された電子メールアドレスで偽の&quot;@&quot;問題を解決することに注意すべきである。

source: As with Perl 5 array interpolation, the elements are separated by a space.
ja: Perlで5つが展開を配列して、要素はスペースで区切られる。

source: (Except that a space is not added if the element already ends in some kind of whitespace.
ja: （が、要素が何らかの空白文字ですでに終わるならば、スペースは加えられない。

source: In particular, a list of pairs will interpolate with a tab between the key and value, and a newline after the pair.)
ja: 特に、組のリストは、キーと値の間のタブと一組の後の改行文字で改竄する。）

source: Hashes
ja: ハッシュ

source: In order to interpolate an entire hash, it's necessary to subscript with empty braces or angles:
ja: 全ハッシュを差し込むために、それは空のブレースまたは角度で添え字に必要である：

source: Note that this avoids the spurious &quot;%&quot; problem in double-quoted printf formats.
ja: これが倍を引合いに出されたprintfフォーマットで偽の&quot;%&quot;問題を避けることに注意すべきである。

source: By default, keys and values are separated by tab characters, and pairs are terminated by newlines.
ja: デフォルトで、キーと値はタブ文字で区切られる、そして、組は改行文字によって終了される。

source: (This is almost never what you want, but if you want something polished, you can be more specific.)
ja: （これはほとんど、あなたが望むものでない、しかし、磨かれた何かを望むならば、あなたはよりはっきりしていることがありえる。）

source: Sub calls
ja: 下位呼び出し

source: In order to interpolate the result of a sub call, it's necessary to include both the sigil and parentheses:
ja: 下位呼び出しの結果を差し込むために、シギルと括弧を含むことが、必要である：

source: Method calls
ja: メソッドは訪問する

source: In order to interpolate the result of a method call without arguments, it's necessary to include parentheses or extend the call with something ending in brackets:
ja: 引数なしでメソッド呼び出しの結果を差し込むために、括弧を含むか、ブラケットで終わっている何かで呼び出しを延長することが、必要である：

source: The method is called in item context.
ja: メソッドは、アイテム前後関係で呼ばれる。

source: (If it returns a list, that list is interpolated as if it were an array.)
ja: （それがリストを返るならば、まるでそれが配列であるように、そのリストは改変される。）

source: It is allowed to have a cascade of argumentless methods as long as the last one ends with parens:
ja: 最後のものが括弧で終わる限り、それはたくさんのargumentlessなメソッドがあるのを許される：

source: (The cascade is basically counted as a single method call for the end-bracket rule.)
ja: （滝はエンドブラケット支配の一回のメソッド要請として基本的に計算に入れられる。）

source: Multiple dereferencers
ja: 複数のdereferencers

source: Multiple dereferencers may be stacked as long as each one ends in some kind of bracket or is a bare method:
ja: それぞれが何らかのブラケットで終わるか、裸のメソッドである限り、複数のdereferencersは積み重なるかもしれない：

source: Note that the final period above is not taken as part of the expression since it doesn't introduce a bracketed dereferencer.
ja: それが括弧に入れられたdereferencerを導入しない時から、上記の最後の期間が表現の一部としてかかられないことに注意すべきである。

source: The parens are not required on the .gethash, but they are required on the .attr(), since that terminates the entire interpolation.
ja: 括弧は.gethashの上で必要とされない、しかし、それが全補間法を終了する時から、それらは.attr()の上で必要とされる。

source: In no case may any of the top-level components be separated by whitespace or unspace.
ja: いかなる場合も、トップレベルの構成要素の何も、空白文字またはunspaceによって切り離されないかもしれない。

source: (These are allowed, though, inside any bracketing constructs, such as in the (1, 2, 3) above.)
ja: （これらは、しかし、構成概念を括弧に入れている何の中にでも許される（例えば上の(1, 2, 3)で）。）

source: Closures
ja: クロージャ

source: A bare closure also interpolates in double-quotish context.
ja: 裸のクロージャも、二重のquotish前後関係で改竄する。

source: It may not be followed by any dereferencers, since you can always put them inside the closure.
ja: あなたが常にそれらをクロージャに入れることができる時から、それの後に何かdereferencersが続かないかもしれない。

source: The expression inside is evaluated in string item context.
ja: 中の表現は、文字列項目前後関係で評価される。

source: You can force list context on the expression using the list operator if necessary.
ja: あなたは、必要に応じてlist演算子を使っている表現に関して、リストコンテキストを強制することができる。

source: A closure in a string establishes its own lexical scope.
ja: 文字列のクロージャは、それ自身のレキシカルスコープを確立する。

source: (Expressions that sneak in without curlies, such as $(...), do not establish their own lexical scope, but use the outer scope, and may even declare variables in the outer scope, since all the code inside (that isn't in an EVAL) is seen at compile time.)
ja: （curlies（例えば$(...)）なしでこっそり入る表現は彼ら自身のレキシカルスコープを確立しなくて、外のスコープを使って、中（EVALでない）のすべてのコードがコンパイル時で見られる時から外のスコープで変数を宣言さえするかもしれない。）

source: The following means the same as the previous example.
ja: 以下は、前の例と同じことを意味する。

source: The final parens are unnecessary since we're providing &quot;real&quot; code in the curlies.
ja: 我々がcurliesで「本当の」コードを提供している時から、最終的な括弧は不必要である。

source: If you need to have double quotes that don't interpolate curlies, you can explicitly remove the capability:
ja: curliesを差し込まないダブルクォートを持っている必要があるならば、あなたは機能をはっきりと除去することができる：

source: or equivalently:
ja: または、同等に：

source: Alternately, you can build up capabilities from single quote to tell it exactly what you do want to interpolate:
ja: あるいは、あなたは、正確に、何を差し込みたいかについて、それに話すシングルクォートからの機能を確立することができる：

source: Secondary sigils (twigils) have no influence over whether the primary sigil interpolates.
ja: 第二のシギル（twigils）は、主要なシギルが改竄するかどうかに対する影響力を持たない。

source: That is, if $a interpolates, so do $^a, $*a, $=a, $?a, $.a, etc. It only depends on the $.
ja: すなわち、$aが改竄するならば、それが$次第であるだけであるほど、$^a、$*a、$=a、$?a、$.a、その他をする。

source: Other expressions
ja: 他の表現

source: No other expressions interpolate.
ja: 他のいかなる表現も改竄しない。

source: Use curlies.
ja: curliesを使いなさい。

source: Class methods
ja: クラスメソッド

source: A class method may not be directly interpolated.
ja: クラスメソッドは、直接差し込まれないかもしれない。

source: Use curlies:
ja: 使用curlies：

source: Old disambiguation
ja: 古い一義化

source: The old disambiguation syntax:
ja: 旧一義化構文：

source: is dead.
ja: 死んでいる。

source: Use closure curlies instead:
ja: その代わりにクロージャcurliesを使いなさい：

source: (You may be detecting a trend here...)
ja: （あなたは傾向をここで見つけているかもしれない...）

source: Topical methods
ja: 時事的なメソッド

source: To interpolate a topical method, use curlies:
ja: 時事的なメソッド（使用curlies）を差し込むこと：

source: Function calls
ja: 関数呼出し

source: To interpolate a function call without a sigil, use curlies:
ja: シギル（使用curlies）なしで関数呼び出しを差し込むこと：

source: Backslash sequences
ja: バックスラッシュシーケンス

source: Backslash sequences still interpolate, but there's no longer any \v to mean vertical tab, whatever that is...
ja: バックスラッシュシーケンスはまだ改竄する、しかし、それがたとえ何であろうとも、もはや何か\vが平均垂直タブにない...

source: (\v now matches vertical whitespace in a regex.) Literal character representations are:
ja: （\vは現在正規表現で垂直空白文字に匹敵する。）文字通りの文字表示は、以下の通りである：

source: Other functions
ja: 他の関数

source: There's also no longer any \L, \U, \l, \u, or \Q.
ja: もはや何か\L、\U、\l、\uまたは\Qもない。

source: Use curlies with the appropriate function instead:
ja: 適正による使用curliesは、その代わりに機能する：

source: Unicode codepoints
ja: ユニコードコードポイント

source: You may interpolate any Unicode codepoint by name using \c and square brackets:
ja: あなたは、\cと角括弧を使用して名前は何かユニコードコードポイントを差し込むかもしれない：

source: Multiple codepoints constituting a single character may be interpolated with a single \c by separating the names with comma:
ja: 一文字を構成している複数のコードポイントは、コンマで名前を切り離すことによって、一つの\cで差し込まれるかもしれない：

source: Whether that is regarded as one character or two depends on the Unicode support level of the current lexical scope.
ja: それが一体となって注意されるかどうかにかかわらず、文字または2は現在のレキシカルスコープのユニコード支持線次第である。

source: It is also possible to interpolate multiple codepoints that do not resolve to a single character:
ja: 一文字に分解しない複数のコードポイントを差し込むことも、あり得る：

source: [Note: none of the official Unicode character names contains comma.]
ja: ［注意する：公式ユニコード文字名のどれもコンマを含まない。］

source: You may also put one or more decimal numbers inside the square brackets:
ja: あなたは、一つ以上の十進数も角括弧に入れるかもしれない：

source: Any single decimal number may omit the brackets:
ja: 何か一つの十進数は、ブラケットを省略するかもしれない：

source: (Within a regex you may also use \C to match a character that is not the specified character.)
ja: （正規表現の中で、あなたは文字（つまり指定された文字でない）にマッチするために\Cも使うかもしれない。）

source: If the character following \c or \C is neither a left square bracket nor a decimal digit, the single following character is turned into a control character by the usual trick of XORing the 64 bit.
ja: \cまたは\Cの後の文字が左大括弧10進数でももないならば、一つの以下の文字は64が噛んだXORingの普通のこつによって制御文字に変えられる。

source: This allows \c@ for NULL and \c? for DELETE, but note that the ESCAPE character may not be represented that way;
ja: これは、キャンセル（エスケープ文字がそのように表現されないかもしれないメモ以外の）のために、ヌルと\c?に\c@を見込む;

source: it must be represented something like:
ja: それは、何かを表現されなければならない：

source: Obviously \e is preferred when brevity is needed.
ja: 明らかに、簡潔さが必要であるとき、\eは好まれる。

source: Any character that would start an interpolation in the current quote context may be protected from such interpolation by prefixing with backslash.
ja: 改竄者に現在の引用前後関係を始めさせる何か文字は、バックスラッシュでプレフィクシングによってそのような展開から保護されているかもしれない。

source: The backslash is always removed in this case.
ja: バックスラッシュは、常にこの場合削除される。

source: The treatment of backslashed characters that would not have introduced an interpolation varies depending on the type of quote:
ja: 改竄者を紹介しなかったbackslashedされた文字の処置は、引用の型に従い変化する：

source: 1. Any quoting form that includes qq or :qq in its semantic derivation (including the normal double quote form) assumes that all backslashes are to be considered meaningful.
ja: 1. qqまたは:qqをその意味導出（通常のダブルクォート形式を含む）に含む調子を引合いに出している何でも、すべてのバックスラッシュが意味があると考えられることになっていると仮定する。

source: The meaning depends on whether the following character is alphanumeric;
ja: 意味は、以下の文字が英数字かどうか次第である;

source: if it is, the non-interpolating sequence produces a compile-time error.
ja: それがそうであるならば、非補間列はコンパイル時エラーを生じる。

source: If the character is non-alphanumeric, the backslash is silently removed, on the assumption that the string was backslashed using quotemeta() or some such.
ja: 文字が非英数字であるならば、文字列がquotemeta()または少しそれを用いてbackslashedされたという仮定に関して、バックスラッシュは黙って削除される。

source: 2. All other quoting forms (including standard single quotes) assume that non-interpolating sequences are to be left unaltered because they are probably intended to pass through to the result.
ja: 2. 他の全ての引合いに出している形（標準的なシングルクォートを含む）は、それらが終わりまで結果に渡ることを多分意図されるだろうので、非補間列が不変のままにされることになっていると仮定する。

source: Backslashes are removed only for the terminating quote or for characters that would interpolate if unbackslashed.
ja: バックスラッシュは、終わっている引用のためにだけ、または、unbackslashedされるならば、それが改変するだろう文字のためにだけ削除される。

source: (In either case, a special exception is made for brackets;
ja: （いずれにせよ、特例はブラケットのために作られる;

source: if the left bracket would interpolate, the right bracket may optionally also be backslashed, and if so, the backslash will be removed.
ja: 左大括弧が差し込むならば、右大括弧は任意にbackslashedされもするかもしれない、そして、もしそうならば、バックスラッシュは削除される。

source: If brackets are used as the delimiters, both left and right must be backslashed the same, since they would otherwise be counted wrong in the bracket count.)
ja: ブラケットがデリミタとして使われる、両方の左右｛必要なもの｝さもなければそれらがブラケット数の数えられた誤りである時から、backslashedが同じことである。）

source: As a consequence, these all produce the same literal string:
ja: 結果として、これらのすべては、同じリテラル文字列を生産する：

source: (Of course, matching backslashes is likely to make your syntax highlighter a bit happier, along with any other naive bracket counting algorithms...)
ja: （もちろん、他のどの単純なブラケットカウントアルゴリズムとともにも、バックスラッシュにマッチすることはあなたの構文マーカーを少しより幸せにしそうである...）

source: Bare identifiers
ja: 裸の識別子

source: There are no barewords in Perl 6.
ja: barewordsが、Perl 6でない。

source: An undeclared bare identifier will always be taken to mean a subroutine name, and be parsed as a list operator.
ja: 宣言されていない裸の識別子は、常にサブルーチン名を意味するためにとられて、リスト演算子として解析される。

source: (Class names (and other type names) are predeclared, or prefixed with the :: type sigil when you're declaring a new one.) A consequence of this is that there's no longer any &quot;use strict 'subs'&quot;.
ja: これの結果は、もはや何か&quot;use strict 'subs'&quot;がないということである（クラス名（そして、他のタイプ名）は、predeclaredされるか、あなたが新しいものを宣言している::タイプシギルで接頭辞を付けられる。）。

source: Since the syntax for method calls is distinguished from sub calls, it is only unrecognized sub calls that must be treated specially.
ja: メソッド呼び出しのための構文が下位呼び出しを区別されるので、それは特別に扱われなければならない認められていない下位呼び出しだけである。

source: You still must declare your subroutines, but a bareword with an unrecognized name is provisionally compiled as a subroutine call, on the assumption that such a declaration will occur by the end of the current compilation unit:
ja: あなたはまだサブルーチンを宣言しなければならない、しかし、そのような宣言が現在のコンパイル単位の終りまでに起こるという仮定に関して、認められていない名前によるbarewordはサブルーチン呼出しとして仮に編集される：

source: If a postdeclaration is not seen, the compile fails at CHECK time, that is, at the end of compilation for this compilation unit.
ja: postdeclarationが見られないならば、コンパイルはCHECK時間に失敗する（つまり、このコンパイル単位のための編集終了後）。

source: (You are still free to predeclare subroutines explicitly, of course.) The postdeclaration may be in any lexical or package scope that could have made the declaration visible to the provisional call had the declaration occurred before rather than after the provisional call.
ja: postdeclarationは語彙的な何ででもあるかもしれない（もちろん、あなたはまだはっきりとpredeclareサブルーチンに自由である。）、または、暫定的な呼び出しの後よりはむしろ、宣言を暫定的な呼び出しに見えるようにすることができたパッケージスコープは宣言を起こっておいた。

source: This fixup is done only for provisional calls.
ja: このfixupは、暫定的な呼び出しのためにだけされる。

source: If there is any real predeclaration visible, it always takes precedence.
ja: 見える何か本当のpredeclarationがあるならば、それは常に優位をとる。

source: If the unrecognized subroutine name is followed by postcircumfix:&lt;( )&gt;,
ja: 認められていないサブルーチン名の後にpostcircumfix:&lt;( )&gt;が続くならば、

source: it is compiled as a provisional function call of the parenthesized form.
ja: それは、括弧に入れられた形の暫定的な関数呼び出しとして編集される。

source: If it is not, it is compiled as a provisional function call of the list operator form, which may or may not have an argument list.
ja: そうでないならば、それはリスト演算子形式の暫定的な関数呼び出しとして編集される。そして、それは引数の並びを持つかもしれないか、持たないかもしれない。

source: When in doubt, the attempt is made to parse an argument list.
ja: 不確かなとき、試みは引数の並びを解析させられる。

source: As with any list operator, an immediate postfix operator is illegal unless it is a form of parentheses, whereas anything following whitespace will be interpreted as an argument list if possible.
ja: 何かリスト演算子と同様に、それが括弧の形でない限り、即座の後置演算子は無効である、ところが、空白文字の後の何でもできれば引数の並びと解釈される。

source: Some examples of how listops, methods and labels interact syntactically:
ja: listops、メソッドとラベルがどのように構文的に相互作用するかという若干の例：

source: The indirect object colon only ever dominates a simple term, where &quot;simple&quot; includes classes and variables and parenthesized expressions, but explicitly not method calls, because the colon will bind to a trailing method call in preference.
ja: 間接目的語コロンはこれまでに単純な項を支配するだけである、そこで、コロンが選択において後置メソッド呼び出しと結合するので、「単純な」ものはクラスと変数を含んで、はっきりとメソッド呼び出しでなく、表現を括弧に入れた。

source: An indirect object that parses as more than one token must be placed in parentheses, followed by the colon.
ja: 複数のトークンとして解析する間接目的語は括弧に置かれなければならない。そして、コロンが続く。

source: In short, only an identifier followed by a simple term followed by a postfix colon is ever parsed as an indirect object, but that form will always be parsed as an indirect object regardless of whether the identifier is otherwise declared.
ja: 要するに、接尾辞コロンが続く単純な項が続く識別子だけは間接目的語として解析されるeverである、さもなければ識別子が宣言されるか否かを問わず、その形以外の、alwaysは間接目的語として解析される。

source: Dereferences
ja: 間接参照

source: There's also no &quot;use strict 'refs'&quot; because symbolic dereferences are now syntactically distinguished from hard dereferences.
ja: 記号的な間接参照が現在難しい間接参照を構文的に区別されるので、&quot;use strict 'refs'&quot;もない。

source: @($array) must now provide an actual array object, while @::($string) is explicitly a symbolic reference.
ja: @::($string)がはっきりと記号参照である間、@($array)は現在実配列オブジェクトを提供しなければならない。
